app/Http/Livewire/Frontpage/NextGame.php

    public function mount()
    {
        $this->today = Carbon::today();
        $this->next_match = Date::where('date_type_id',2)->where('datetime','>=', Carbon::now())->orderBy('datetime')->with('match', 'match.teamHome', 'match.teamAway')->first();
---
select * from `dates` where `date_type_id` = 2 and `datetime` >= '2021-03-07 22:38:17' order by `datetime` asc limit 1
select * from `matches` where `matches`.`date_id` in (668)