app/Http/Livewire/Calendar.php

select DISTINCT(DATE_FORMAT(datetime,'%Y')) AS date from `dates`
select * from `dates` where `published` = 1 and `datetime` >= '2021-01-01 00:00:00' and `datetime` <= '2021-12-31 23:59:59' order by `datetime` asc
select * from `date_types` where `date_types`.`id` in (1, 2, 4)
select * from `match_types` where `match_types`.`id` in (1, 2)
select * from `matches` where `matches`.`date_id` in (665, 666, 668, 670, 671, 672)
select * from `tournaments` where `tournaments`.`date_id` in (665, 666, 668, 670, 671, 672)
---
    public function render()
    {
        $this->selectable_years = collect(DB::table('dates')->selectRaw("DISTINCT(DATE_FORMAT(datetime,'%Y')) AS date")->get());
        $this->selectable_years = $this->selectable_years->whereNotNull('date');

        $selected_year_to_date = Carbon::createFromDate($this->selected_year);
        $start_of_selected_year = $selected_year_to_date->copy()->startOfYear();
        $end_of_selected_year = $selected_year_to_date->copy()->endOfYear();
        $this->dates = Date::published()->where('datetime','>=',$start_of_selected_year)->where('datetime','<=',$end_of_selected_year)->orderBy('datetime')->get();
        $this->dates->load('dateType', 'match', 'tournament', 'match.matchtype');