app/Http/Livewire/NextBirthday.php

select * from `players` where month(`dob`) = '03'
---
    public function mount()
    {
        $this->players = Player::hasNotLeft()->whereMonth('dob',Carbon::now()->format('m'))->get();