app/Http/Livewire/Poll.php

select * from `date_options` where `date_options`.`date_id` in (668)
select * from `date_types` where `date_types`.`id` in (2)
select `clubs`.*, `club_date`.`date_id` as `pivot_date_id`, `club_date`.`club_id` as `pivot_club_id`, `club_date`.`created_at` as `pivot_created_at`, `club_date`.`updated_at` as `pivot_updated_at` from `clubs` inner join `club_date` on `clubs`.`id` = `club_date`.`club_id` where `club_date`.`date_id` in (668)
select * from `dates` where `dates`.`id` in (665, 666, 668, 671)
---
    public function mount(Date $date)
    {
        $this->date = $date;
        $this->date->load('dateOptions', 'dateType', 'clubs.players', 'match.matchType', 'tournament');