app/Http/Livewire/RandomQuote.php

select * from `quotes`
---
    public function render()
    {
        $this->quote = Quote::all()->random();